# RailingSystemSecondaryFamilyHandrails Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..RailingSystemSecondaryFamilyHandrails Property
GroupTypeId Class See Also
---
Handrail 2.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId RailingSystemSecondaryFamilyHandrails { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailingSystemSecondaryFamilyHandrails As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RailingSystemSecondaryFamilyHandrails {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace